#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/philward_io/philward_io/runs/run-p96CAneRg6V1QqhQ

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_get_function_zip: Reading...
data.archive_file.lambda_put_function_zip: Reading...
data.archive_file.lambda_put_function_zip: Read complete after 0s [id=92ff09ef7a732b24c84bd3ef89fda90b3df2a284]
data.archive_file.lambda_get_function_zip: Read complete after 0s [id=27c289a2b8b7fb62e77b89a552c39f01b0aecb28]
aws_acm_certificate.acm_certificate: Refreshing state... [id=arn:aws:acm:us-east-1:542829616420:certificate/4f2a114c-9f30-4784-b67b-5aee7a41f19a]
data.aws_caller_identity.current: Reading...
aws_route53_zone.philward_io_zone: Refreshing state... [id=Z003529526RCV8G5J1PS7]
aws_cloudfront_response_headers_policy.security_headers_policy: Refreshing state... [id=dbd58526-3795-4dea-a38a-b0d743f4caaf]
data.aws_route53_zone.philward_io_zone: Reading...
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Reading...
aws_s3_bucket.legacy_resume_bucket: Refreshing state... [id=legacy-resume.philward.io]
aws_s3_bucket.resume_bucket: Refreshing state... [id=resume.philward.io]
aws_route53domains_registered_domain.philward_io_domain: Refreshing state... [id=philward.io]
aws_cloudfront_origin_access_identity.resume_oai: Refreshing state... [id=E1AVBUZT0CBMF6]
aws_s3_bucket.resume_lambda_bucket: Refreshing state... [id=lambda.philward.io]
data.aws_caller_identity.current: Read complete after 0s [id=542829616420]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
aws_route53_record.hashnode_blog_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_blog.philward.io_CNAME]
data.aws_iam_policy_document.kms_ksk_policy: Reading...
data.aws_iam_policy_document.kms_ksk_policy: Read complete after 0s [id=3690054669]
aws_kms_key.dnssec_kms_key: Refreshing state... [id=43f31946-1cde-40ab-a194-21839adc741f]
aws_route53_key_signing_key.philward_io_ksk: Refreshing state... [id=Z003529526RCV8G5J1PS7,philward_io_KSK]
data.aws_route53_zone.philward_io_zone: Read complete after 0s [id=Z003529526RCV8G5J1PS7]
aws_route53_record.acm_validation_record["*.philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
aws_route53_record.acm_validation_record["philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
aws_route53_hosted_zone_dnssec.philward_io_dnssec: Refreshing state... [id=Z003529526RCV8G5J1PS7]
aws_s3_object.lambda_put_function_object: Refreshing state... [id=put_function.zip]
aws_s3_bucket_public_access_block.resume_lambda_bucket_access_block: Refreshing state... [id=lambda.philward.io]
aws_s3_object.lambda_get_function_object: Refreshing state... [id=get_function.zip]
aws_s3_bucket_public_access_block.resume_bucket_access_block: Refreshing state... [id=resume.philward.io]
data.aws_iam_policy_document.resume_bucket_policy_document: Reading...
aws_s3_object.resume_bucket_contents["css/styles.css"]: Refreshing state... [id=css/styles.css]
data.aws_iam_policy_document.resume_bucket_policy_document: Read complete after 0s [id=3877817331]
aws_s3_object.resume_bucket_contents["assets/img/favicon.png"]: Refreshing state... [id=assets/img/favicon.png]
aws_s3_object.resume_bucket_contents["index.html"]: Refreshing state... [id=index.html]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E5CPX462LFNKX]
aws_s3_object.resume_bucket_contents["assets/img/profile.png"]: Refreshing state... [id=assets/img/profile.png]
aws_s3_object.resume_bucket_contents["js/scripts.js"]: Refreshing state... [id=js/scripts.js]
aws_s3_bucket_policy.resume_bucket_policy: Refreshing state... [id=resume.philward.io]
aws_route53_record.root_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_philward.io_A]
aws_route53_record.resume_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_resume.philward.io_A]
aws_s3_object.legacy_resume_bucket_contents["legacy_index.html"]: Refreshing state... [id=legacy_index.html]
aws_s3_object.legacy_resume_bucket_contents["reset-fonts-grids.css"]: Refreshing state... [id=reset-fonts-grids.css]
aws_s3_object.legacy_resume_bucket_contents["resume.css"]: Refreshing state... [id=resume.css]
aws_s3_bucket_website_configuration.legacy_bucket_website: Refreshing state... [id=legacy-resume.philward.io]
data.aws_iam_policy_document.legacy_resume_bucket_policy_document: Reading...
data.aws_iam_policy_document.legacy_resume_bucket_policy_document: Read complete after 0s [id=1724937241]
aws_s3_bucket_acl.legacy_resume_bucket_acl: Refreshing state... [id=legacy-resume.philward.io,public-read]
aws_s3_bucket_policy.legacy_resume_bucket_policy: Refreshing state... [id=legacy-resume.philward.io]
aws_route53_record.legacy_resume_record: Refreshing state... [id=Z003529526RCV8G5J1PS7_legacy-resume.philward.io_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.get_function_log_group will be created
  + resource "aws_cloudwatch_log_group" "get_function_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/get_function"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.put_function_log_group will be created
  + resource "aws_cloudwatch_log_group" "put_function_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/put_function"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_iam_role.lambda_exec will be created
  + resource "aws_iam_role" "lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "serverless_lambda"
    }

  # aws_lambda_function.get_function will be created
  + resource "aws_lambda_function" "get_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "get_function"
      + handler                        = "get.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + s3_bucket                      = "lambda.philward.io"
      + s3_key                         = "get_function.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "pU2m0SSmHXYl+h4w5lVsTiQjk0UFRrZbapRw2TI1VjU="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.put_function will be created
  + resource "aws_lambda_function" "put_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "put_function"
      + handler                        = "put.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + s3_bucket                      = "lambda.philward.io"
      + s3_key                         = "put_function.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "5VIrYVtD06YUOV6PSXhyPlPHzOrAMmTbBsg8hPQvfQI="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + get_function_name = "get_function"
  + put_function_name = "put_function"

```

</details>

*Pushed by: @phil-ward, Action: `pull_request`*